Repository: Bee220624/Dnsmasq-for-Mac
Catalog: Apps/DnsmasqForMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld Categories
zh_hans: %lld 个类别

source: %lld earlier line(s) are no longer in memory. The complete log is on disk in the session directory.
zh_hans: 有 %lld 行更早的日志已不在内存中。完整日志保存在会话目录的磁盘文件里。

source: Active
zh_hans: 使用中

source: Addresses
zh_hans: 地址数

source: Addresses will be handed out from %@.
zh_hans: 将从 %@ 分配地址。

source: Addressing
zh_hans: 地址配置

source: All Categories
zh_hans: 全部类别

source: App bundle is incomplete
zh_hans: App 包不完整

source: Application
zh_hans: 应用程序

source: Architecture
zh_hans: 架构

source: At least one profile must remain
zh_hans: 至少需保留一个配置

source: Authoritative
zh_hans: 权威模式

source: Auto-scroll
zh_hans: 自动滚动

source: BSD Name
zh_hans: BSD 名称

source: Bridge
zh_hans: 网桥

source: Broadcast
zh_hans: 广播地址

source: Build
zh_hans: 构建版本

source: Bundle Identifier
zh_hans: Bundle 标识符

source: Cancel
zh_hans: 取消

source: Checking…
zh_hans: 检查中…

source: Choose a network interface.
zh_hans: 请选择一个网络接口。

source: Choose a profile to see its settings.
zh_hans: 选择一个配置以查看其设置。

source: Choose an interface…
zh_hans: 选择接口…

source: Choose the adapter connected to your device network.
zh_hans: 请选择连接到设备网络的网卡。

source: Cleanup After A Previous Session
zh_hans: 已清理上一次会话的残留

source: Clear View
zh_hans: 清空视图

source: Client ID
zh_hans: 客户端 ID

source: Compile Options
zh_hans: 编译选项

source: Configuration Check Output
zh_hans: 配置检查输出

source: Confirm the interface is on an isolated network.
zh_hans: 请确认该接口连接的是隔离网络。

source: Connect a USB or Thunderbolt Ethernet adapter. Wi-Fi and the interface carrying this Mac's internet connection cannot be used.
zh_hans: 请连接 USB 或 Thunderbolt 以太网卡。Wi-Fi 以及承载本机互联网连接的接口不可使用。

source: Connect to the privileged helper to see engine details.
zh_hans: 连接到特权 helper 后可查看引擎详情。

source: Connected
zh_hans: 已连接

source: Copy Hostname
zh_hans: 拷贝主机名

source: Copy IP Address
zh_hans: 拷贝 IP 地址

source: Copy MAC Address
zh_hans: 拷贝 MAC 地址

source: Copy Row
zh_hans: 拷贝整行

source: Could Not Export Log
zh_hans: 无法导出日志

source: Current IPv4
zh_hans: 当前 IPv4

source: DHCP and DNS settings
zh_hans: DHCP 与 DNS 设置

source: DHCP can disrupt an existing network.
zh_hans: DHCP 可能扰乱现有网络。

source: DHCP pool valid
zh_hans: DHCP 地址池有效

source: DNS configuration valid
zh_hans: DNS 配置有效

source: Default
zh_hans: 默认

source: Default profile
zh_hans: 默认配置

source: Delete
zh_hans: 删除

source: Delete profile
zh_hans: 删除配置

source: Delete this profile
zh_hans: 删除此配置

source: Delete “%@”?
zh_hans: 要删除“%@”吗？

source: Delete…
zh_hans: 删除…

source: Development build. The helper enforces the same caller verification as a release build.
zh_hans: 开发版本。helper 执行与正式版本完全相同的调用方校验。

source: Devices on the network you connect to will take addresses from Dnsmasq for Mac instead of from their usual DHCP server.
zh_hans: 所连接网络中的设备将从 Dnsmasq for Mac 获取地址，而不再从原本的 DHCP 服务器获取。

source: Disabled
zh_hans: 已停用

source: Discard Changes
zh_hans: 放弃更改

source: Dismiss
zh_hans: 关闭

source: Dnsmasq for Mac bundles dnsmasq by Simon Kelley as a separate, unmodified program. No dnsmasq code is compiled or linked into Dnsmasq for Mac itself.
zh_hans: Dnsmasq for Mac 以独立且未经修改的程序形式附带 Simon Kelley 的 dnsmasq。Dnsmasq for Mac 自身不编译或链接任何 dnsmasq 代码。

source: Dnsmasq for Mac does not collect analytics, upload logs, or send network configuration to external services.
zh_hans: Dnsmasq for Mac 不收集分析数据、不上传日志，也不会将网络配置发送到外部服务。

source: Dnsmasq for Mac needs a privileged helper
zh_hans: Dnsmasq for Mac 需要一个特权 helper

source: Dnsmasq for Mac services are still running.
zh_hans: Dnsmasq for Mac 的服务仍在运行。

source: Dnsmasq for Mac will not be able to start any service until the helper is installed again.
zh_hans: 在重新安装 helper 之前，Dnsmasq for Mac 将无法启动任何服务。

source: Done
zh_hans: 完成

source: Duplicate
zh_hans: 复制

source: Editable DHCP and DNS forms are added in a later phase. The values from the selected profile are used as-is.
zh_hans: 可编辑的 DHCP 与 DNS 表单将在后续阶段加入。当前直接使用所选配置中的值。

source: Empty the view. The log file on disk is not changed.
zh_hans: 仅清空视图，磁盘上的日志文件不受影响。

source: Enable Dnsmasq for Mac, then return here.
zh_hans: 启用 Dnsmasq for Mac 后返回此处。

source: Error
zh_hans: 错误

source: Ethernet
zh_hans: 以太网

source: Expired
zh_hans: 已过期

source: Expires
zh_hans: 到期时间

source: Export…
zh_hans: 导出…

source: Failed
zh_hans: 未通过

source: Fix the problems listed under Preflight.
zh_hans: 请先解决「启动前检查」中列出的问题。

source: GPL v2 Licence Text
zh_hans: GPL v2 许可证全文

source: GPL v3 Licence Text
zh_hans: GPL v3 许可证全文

source: Generated configuration valid
zh_hans: 生成的配置有效

source: Hardware Port
zh_hans: 硬件端口

source: Helper Version
zh_hans: Helper 版本

source: Helper installed
zh_hans: Helper 已安装

source: Helper version compatible
zh_hans: Helper 版本兼容

source: Hostname
zh_hans: 主机名

source: I confirm that %@ is connected only to the intended isolated device or lab network.
zh_hans: 我确认 %@ 仅连接到预期的隔离设备网络或实验网络。

source: IP Address
zh_hans: IP 地址

source: IPv4 configuration valid
zh_hans: IPv4 配置有效

source: If you quit without stopping, DHCP and DNS keep running and the temporary IP address stays on the interface until you start Dnsmasq for Mac again.
zh_hans: 若直接退出，DHCP 与 DNS 将继续运行，临时 IP 地址也会保留在接口上，直到你再次打开 Dnsmasq for Mac。

source: Incompatible
zh_hans: 不兼容

source: Install Helper
zh_hans: 安装 Helper

source: Install the privileged helper in Settings first.
zh_hans: 请先在「设置」中安装特权 helper。

source: Installed
zh_hans: 已安装

source: Installed and running
zh_hans: 已安装并正在运行

source: Interface
zh_hans: 接口

source: Interface is not the default route
zh_hans: 接口不是默认路由

source: Interface supported
zh_hans: 接口受支持

source: It accepts requests only from this app, verified by code signature.
zh_hans: 它只接受本 App 的请求，并通过代码签名验证。

source: Lease
zh_hans: 租约时长

source: Leases
zh_hans: 租约

source: Licenses
zh_hans: 许可证

source: Link
zh_hans: 链路

source: Live dnsmasq output appears here while a session is running.
zh_hans: 会话运行时，dnsmasq 的实时输出将显示在这里。

source: Local domain
zh_hans: 本地域名

source: Local records
zh_hans: 本地记录

source: Logs
zh_hans: 日志

source: Loopback
zh_hans: 回环

source: MAC Address
zh_hans: MAC 地址

source: MIT Licence Text
zh_hans: MIT 许可证全文

source: Make another profile the default first
zh_hans: 请先将另一个配置设为默认

source: Name
zh_hans: 名称

source: Network
zh_hans: 网络地址

source: Never expires
zh_hans: 永不过期

source: New
zh_hans: 新建

source: New profile
zh_hans: 新建配置

source: No Profile Selected
zh_hans: 未选择配置

source: No active DHCP session.
zh_hans: 当前没有运行中的 DHCP 会话。

source: No link
zh_hans: 无链路

source: No link detected
zh_hans: 未检测到链路

source: No log output
zh_hans: 暂无日志输出

source: No network interfaces found.
zh_hans: 未找到任何网络接口。

source: No usable interface
zh_hans: 没有可用接口

source: Not checked yet
zh_hans: 尚未检查

source: Not installed
zh_hans: 未安装

source: Not ready
zh_hans: 未就绪

source: Nothing starts at login or at boot.
zh_hans: 不会在登录或开机时自动启动任何内容。

source: OK
zh_hans: 好

source: Open Login Items & Extensions, then enable Dnsmasq for Mac. This window updates on its own once you do.
zh_hans: 打开「登录项与扩展」并启用 Dnsmasq for Mac。完成后本窗口会自动更新。

source: Open Login Items Settings
zh_hans: 打开登录项设置

source: Open Notices File
zh_hans: 打开声明文件

source: Overview
zh_hans: 概览

source: Passed
zh_hans: 已通过

source: Pause
zh_hans: 暂停

source: Preflight
zh_hans: 启动前检查

source: Preflighting
zh_hans: 检查中

source: Privacy
zh_hans: 隐私

source: Privileged Helper
zh_hans: 特权 Helper

source: Profile
zh_hans: 配置

source: Profiles
zh_hans: 配置

source: Protocol Version
zh_hans: 协议版本

source: Quit Without Stopping
zh_hans: 不停止并退出

source: Range
zh_hans: 地址池

source: Re-scan network interfaces
zh_hans: 重新扫描网络接口

source: Ready
zh_hans: 就绪

source: Recovering
zh_hans: 恢复中

source: Refresh
zh_hans: 刷新

source: Refresh interfaces
zh_hans: 刷新接口列表

source: Reinstall Dnsmasq for Mac from your original download.
zh_hans: 请用原始下载的安装包重新安装 Dnsmasq for Mac。

source: Remaining
zh_hans: 剩余时间

source: Remove Helper
zh_hans: 移除 Helper

source: Remove Helper…
zh_hans: 移除 Helper…

source: Remove the privileged helper?
zh_hans: 要移除特权 helper 吗？

source: Rename
zh_hans: 重命名

source: Rename Profile
zh_hans: 重命名配置

source: Rename…
zh_hans: 重命名…

source: Repair Helper
zh_hans: 修复 Helper

source: Required ports available
zh_hans: 所需端口可用

source: Resume
zh_hans: 继续

source: Resume updating. Nothing is lost while paused.
zh_hans: 恢复更新。暂停期间不会丢失任何内容。

source: Revert
zh_hans: 还原

source: Running
zh_hans: 运行中

source: Safety
zh_hans: 安全确认

source: Save
zh_hans: 存储

source: Save changes to this profile?
zh_hans: 要存储对此配置的更改吗？

source: Scanning…
zh_hans: 扫描中…

source: Search
zh_hans: 搜索

source: Select a profile to delete
zh_hans: 请选择要删除的配置

source: Server IPv4
zh_hans: 服务器 IPv4

source: Service status
zh_hans: 服务状态

source: Serving DHCP and DNS means adding a temporary address to a network interface and listening on ports 53 and 67. Only a privileged helper can do that. Dnsmasq for Mac itself never runs with administrator rights.
zh_hans: 提供 DHCP 与 DNS 服务需要向网络接口添加临时地址，并监听 53 与 67 端口。只有特权 helper 才能完成这些操作。Dnsmasq for Mac 自身永远不会以管理员权限运行。

source: Set as Default
zh_hans: 设为默认

source: Settings
zh_hans: 设置

source: Start
zh_hans: 启动

source: Start a session on the Overview page to see devices as they request addresses.
zh_hans: 在「概览」页启动会话后，即可看到请求地址的设备。

source: Start the DHCP and DNS service.
zh_hans: 启动 DHCP 与 DNS 服务。

source: Started
zh_hans: 启动于

source: Starting
zh_hans: 启动中

source: Status
zh_hans: 状态

source: Stop
zh_hans: 停止

source: Stop Services and Quit
zh_hans: 停止服务并退出

source: Stop the running service before removing the helper.
zh_hans: 请先停止正在运行的服务，再移除 helper。

source: Stop updating the view. Collection continues.
zh_hans: 停止刷新视图。日志采集仍在继续。

source: Stopped
zh_hans: 已停止

source: Stopping
zh_hans: 停止中

source: System
zh_hans: 系统

source: Technical Details
zh_hans: 技术详情

source: Temporary alias
zh_hans: 临时别名

source: The bundled engine could not be verified. No session can be started.
zh_hans: 无法验证内置引擎。任何会话都无法启动。

source: The exported log stays on this Mac. Dnsmasq for Mac never uploads it.
zh_hans: 导出的日志仅保存在本机，Dnsmasq for Mac 绝不会上传。

source: The helper is missing from the app bundle. Reinstall Dnsmasq for Mac from your original download.
zh_hans: App 包中缺少 helper。请用原始下载的安装包重新安装 Dnsmasq for Mac。

source: The helper starts only when Dnsmasq for Mac asks it to.
zh_hans: helper 仅在 Dnsmasq for Mac 请求时才会启动。

source: The installed helper does not match this app
zh_hans: 已安装的 helper 与本 App 不匹配

source: The notices file is missing from this build.
zh_hans: 此构建中缺少声明文件。

source: The service is running. Devices will appear here as they request an address.
zh_hans: 服务正在运行。设备请求地址后将出现在这里。

source: Third-Party Notices
zh_hans: 第三方声明

source: Third-Party Notices…
zh_hans: 第三方声明…

source: This confirmation is not saved. It resets when you stop, change interface, or change the address pool.
zh_hans: 此确认不会被保存。停止服务、更换接口或修改地址池后都会重置。

source: This copy of Dnsmasq for Mac is incomplete
zh_hans: 此 Dnsmasq for Mac 副本不完整

source: This interface carries this Mac's internet connection.
zh_hans: 该接口承载着本机的互联网连接。

source: This profile has changes that have not been saved.
zh_hans: 此配置有尚未存储的更改。

source: Try Again
zh_hans: 重试

source: Type
zh_hans: 类型

source: Unavailable
zh_hans: 不可用

source: Unknown
zh_hans: 未知

source: Unknown state (%lld)
zh_hans: 未知状态（%lld）

source: Unregister the privileged helper.
zh_hans: 注销特权 helper。

source: Unsaved Changes
zh_hans: 有未存储的更改

source: Updated
zh_hans: 更新时间

source: Upstream
zh_hans: 上游 DNS

source: Validate Configuration
zh_hans: 校验配置

source: Verified. The helper re-checks the engine's signature before every start.
zh_hans: 已验证。helper 会在每次启动前重新校验引擎签名。

source: Verify Now
zh_hans: 立即验证

source: Version
zh_hans: 版本

source: Virtual
zh_hans: 虚拟

source: Waiting for DHCP clients…
zh_hans: 等待 DHCP 客户端…

source: Waiting for your approval
zh_hans: 等待你的批准

source: Warning
zh_hans: 警告

source: dnsmasq Engine
zh_hans: dnsmasq 引擎

source: dnsmasq binary verified
zh_hans: dnsmasq 二进制已验证
